# MetalThermallyTreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..MetalThermallyTreated Property
StructuralAsset Class See Also
---
Flag indicating whether the asset describes a material that is thermally treated or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool MetalThermallyTreated { get; set; }
```

Visual Basic
---
```text
Public Property MetalThermallyTreated As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool MetalThermallyTreated {
	bool get ();
	void set (bool value);
}
```

# Remarks
Applies to Metal-based structural assets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be Metal to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace